packages/Webkul/Product/src/Type/Virtual.php

    public function isCustomizable()
    {
        /**
         * If the product is a child product of a configurable product, then it is not customizable.
         */
        if ($this->product->parent) {
            return false;
        }

        /**
         * If the product is a child product of a grouped product, then it is not customizable.
         */
        $associatedWithGroupedProduct = $this->productGroupedProductRepository->firstWhere('associated_product_id', $this->product->id);

        if ($associatedWithGroupedProduct) {
            return false;
        }

        /**
         * If the product is a child product of a bundle product, then it is not customizable.
         */
        $associatedWithBundleProduct = $this->productBundleOptionProductRepository->firstWhere('product_id', $this->product->id);
---
select * from `product_grouped_products` where `associated_product_id` = 19561 limit 1
select * from `product_bundle_option_products` where `product_id` = 19561 limit 1