packages/Webkul/Product/src/Repositories/ProductFlatRepository.php

select min(`price`) as aggregate from `product_flat` left join `product_categories` on `product_flat`.`product_id` = `product_categories`.`product_id` where `product_categories`.`category_id` = 6921 and `product_flat`.`status` = 1 and `product_flat`.`price` is not null and `product_flat`.`price` > 0 and `product_flat`.`channel` = 'default' and `product_flat`.`locale` = 'en'
---
     public function getCategoryProductMinPrice(int $categoryId)
    {
        return $this->model
            ->leftJoin('product_categories', 'product_flat.product_id', '=', 'product_categories.product_id')
            ->where('product_categories.category_id', $categoryId)
            ->where('product_flat.status', 1)
            ->whereNotNull('product_flat.price')
            ->where('product_flat.price', '>', 0)
            ->where('product_flat.channel', core()->getCurrentChannelCode())
            ->where('product_flat.locale', core()->getRequestedLocaleCode())
            ->min('price');